In [1]:
import pandas as pd

In [2]:
even=pd.Series([2,4,6,8])
even

0    2
1    4
2    6
3    8
dtype: int64

In [3]:
type(even)

pandas.core.series.Series

DataFrame

In [4]:
## Dataframe using List

In [5]:
Sherk = ['Sherk',2001]
Fantasis = ['Fantasis',1940]
FindingNemo =['Finding Nemo',2003]
Moana = ['Moana',2016]
Movies = pd.DataFrame([Sherk,Fantasis,FindingNemo,Moana])

In [6]:
type(Movies)

pandas.core.frame.DataFrame

In [7]:
Movies.columns=['AnimationMovie','YearofRelease']

In [8]:
Movies

  AnimationMovie  YearofRelease
0          Sherk           2001
1       Fantasis           1940
2   Finding Nemo           2003
3          Moana           2016

In [9]:
##Data Frame using Tuple

In [10]:
apple = ('Apple', 60)
banana = ('Banana', 30)
orange = ('Orange', 50)

df = pd.DataFrame([apple, banana, orange])
df.columns = ['Fruits', 'Price (INR)']
df

   Fruits  Price (INR)
0   Apple           60
1  Banana           30
2  Orange           50

In [11]:
## Creating Data Frame Using Dictionary

In [12]:


sherk = {'Name':'Sherk', 'Year':2001}
fantasis = {'Name':'Fantasis', 'Year':1940}
mona = {'Name':'Mona', 'Year':2016}
df1=pd.DataFrame([sherk,fantasis,mona])
df1

       Name  Year
0     Sherk  2001
1  Fantasis  1940
2      Mona  2016

In [13]:
## Two Dimensional Arrays

In [14]:
Movies = [['Mulan',1998],['Zootopia',2016],['Frozen1',2013]]
df=pd.DataFrame(Movies)
df.columns=['Movies','Year']
df

     Movies  Year
0     Mulan  1998
1  Zootopia  2016
2   Frozen1  2013

In [15]:
### Dictionary of Arrays

In [16]:
fruits = {
'fruits': ['Apple', 'Banana', 'Orange'],
'Price': [60, 30, 50]
}
df = pd.DataFrame(fruits)
df

   fruits  Price
0   Apple     60
1  Banana     30
2  Orange     50

In [17]:
Fruits=df

In [18]:
Fruits

   fruits  Price
0   Apple     60
1  Banana     30
2  Orange     50